[
  {
    "id": 1,
    "title": "Изучение инструментов и интерфейса инженерной графики",
    "content": "<div class=\"practical-content\">\n  <h2>Практическая 1: Изучение инструментов и интерфейса инженерной графики</h2>\n  <p style=\"text-indent: 2em;\">\n    <strong>Цели практической работы:</strong>\n  </p>\n  <ul>\n    <li>Освоить основные элементы интерфейса программного обеспечения для инженерной графики.</li>\n    <li>Научиться эффективно использовать базовые инструменты для создания и редактирования графических объектов.</li>\n    <li>Подготовить рабочее пространство для дальнейшей работы с техническими чертежами и моделями.</li>\n  </ul>\n  <p style=\"text-indent: 2em;\">\n    <strong>Задачи практической работы:</strong>\n  </p>\n  <ul>\n    <li>Ознакомиться с основными панелями и меню выбранной CAD-программы или графического редактора.</li>\n    <li>Научиться создавать простые графические объекты: линии, окружности, прямоугольники.</li>\n    <li>Изучить методы выбора, перемещения и изменения параметров объектов.</li>\n    <li>Настроить параметры отображения рабочего пространства (масштаб, сетка, привязки).</li>\n    <li>Сохранить созданный файл в формате, поддерживаемом программой.</li>\n  </ul>\n  <p style=\"text-indent: 2em;\">\n    В ходе выполнения данной практической работы студент приобретёт базовые навыки работы с инженерной графикой, которые являются фундаментом для последующего освоения более сложных методов и технологий проектирования.\n  </p>\n</div>"
  },
  {
    "id": 2,
    "title": "Создание и анализ технических эскизов",
    "content": "<div class=\"practical-content\">\n  <h2>Практическая 2: Создание и анализ технических эскизов</h2>\n  <p style=\"text-indent: 2em;\"><strong>Цели практической работы:</strong></p>\n  <ul>\n    <li>Освоить навыки создания технических эскизов с соблюдением основных правил и стандартов.</li>\n    <li>Научиться передавать конструктивные особенности и пропорции изделий в эскизах.</li>\n    <li>Развить умение анализировать и корректировать технические рисунки для улучшения качества проектирования.</li>\n  </ul>\n  <p style=\"text-indent: 2em;\"><strong>Задачи практической работы:</strong></p>\n  <ul>\n    <li>Изучить основные виды технических эскизов и их назначение.</li>\n    <li>Научиться выполнять эскизы простых изделий с использованием различных методов проецирования.</li>\n    <li>Освоить приемы выявления объема с помощью шатировки, шраффировки и точечного оттенения.</li>\n    <li>Проанализировать готовые технические эскизы, выявить и исправить возможные ошибки.</li>\n  </ul>\n  <p style=\"text-indent: 2em;\">Ниже приведены примеры технических эскизов, демонстрирующие различные методы отображения изделий и выявления объема:</p>\n  <div style=\"display: flex; gap: 20px; flex-wrap: wrap; justify-content: center;\">\n    <div style=\"max-width: 300px; text-align: center;\">\n      <img src=\"https://forkettle.ru/images/video/Cherchenie/12/367.jpg\" alt=\"Технический эскиз детали\" style=\"width: 100%; border-radius: 8px; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" />\n      <p style=\"font-size: 14px; color: #555; margin-top: 8px;\">Пример технического эскиза детали с аккуратной штриховкой</p>\n    </div>\n    <div style=\"max-width: 300px; text-align: center;\">\n      <img src=\"https://promgrafik.ru/wp-content/uploads/2023/12/ris0.jpg\" alt=\"Технический рисунок изделия\" style=\"width: 100%; border-radius: 8px; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" />\n      <p style=\"font-size: 14px; color: #555; margin-top: 8px;\">Технический рисунок изделия с использованием перспективного проецирования</p>\n    </div>\n    <div style=\"max-width: 300px; text-align: center;\">\n      <img src=\"https://studfile.net/html/2706/278/html_E1LEQgBQ7f.hSVy/img-3uFPyc.png\" alt=\"Штриховка и оттенение\" style=\"width: 100%; border-radius: 8px; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" />\n      <p style=\"font-size: 14px; color: #555; margin-top: 8px;\">Пример штриховки и точечного оттенения для выявления объема</p>\n    </div>\n  </div>\n  <p style=\"text-indent: 2em; margin-top: 20px;\">Выполнение технических эскизов требует аккуратности, внимательности и понимания конструктивных особенностей изделий. Рекомендуется использовать карандаш средней мягкости для удобства исправления ошибок и достижения плавных линий.</p>\n</div>"
  },
  {
    "id": 3,
    "title": "Построение базовых геометрических моделей",
    "content": "<div class=\"practical-content\">\n  <h2>Практическая 3: Построение базовых геометрических моделей</h2>\n  <p style=\"text-indent: 2em;\"><strong>Цели практической работы:</strong></p>\n  <ul>\n    <li>Освоить создание простых геометрических форм и их комбинаций с помощью программных средств инженерной графики.</li>\n    <li>Научиться применять основные инструменты моделирования для построения точных и корректных объектов.</li>\n    <li>Развить навыки пространственного мышления и понимания структуры трёхмерных моделей.</li>\n  </ul>\n  <p style=\"text-indent: 2em;\"><strong>Задачи практической работы:</strong></p>\n  <ul>\n    <li>Изучить основные типы геометрических объектов: точки, линии, плоскости, поверхности и тела.</li>\n    <li>Построить простые объекты: куб, цилиндр, конус, сферу, используя выбранное программное обеспечение.</li>\n    <li>Создать комбинированные модели, объединяя и вычитая базовые формы.</li>\n    <li>Оценить правильность построения моделей и внести необходимые корректировки.</li>\n    <li>Сохранить созданные модели в формате, поддерживаемом программой.</li>\n  </ul>\n  <p style=\"text-indent: 2em;\">Выполнение данной практической работы позволит студентам получить практические навыки работы с базовыми инструментами 3D-моделирования, что является основой для создания сложных инженерных конструкций и дальнейшего освоения компьютерного проектирования.</p>\n</div>"
  },
  {
    "id": 4,
    "title": "Работа с CAD-системами: создание 2D-чертежей",
    "content": "<div class=\"practical-content\">\n  <h2>Практическая 4: Работа с CAD-системами: создание 2D-чертежей</h2>\n  <p style=\"text-indent: 2em;\"><strong>Цели практической работы:</strong></p>\n  <ul>\n    <li>Освоить базовые функции CAD-систем для создания и редактирования двумерных чертежей.</li>\n    <li>Научиться правильно наносить размеры и использовать стандарты оформления технической документации.</li>\n    <li>Развить навыки подготовки чертежей, пригодных для производства и контроля качества.</li>\n  </ul>\n  <p style=\"text-indent: 2em;\"><strong>Задачи практической работы:</strong></p>\n  <ul>\n    <li>Изучить интерфейс выбранной CAD-программы и основные инструменты для работы с 2D-графикой.</li>\n    <li>Создать чертеж простого изделия с использованием линий, дуг, окружностей и других элементов.</li>\n    <li>Нанести необходимые размеры и обозначения в соответствии с ГОСТ или международными стандартами.</li>\n    <li>Оформить чертеж, добавив необходимые надписи, штампы и технические требования.</li>\n    <li>Сохранить и экспортировать чертеж в распространённые форматы для дальнейшего использования.</li>\n  </ul>\n  <p style=\"text-indent: 2em;\">Выполнение данной практической работы позволит студентам получить уверенные навыки работы с CAD-системами, необходимые для создания качественной технической документации и успешной профессиональной деятельности.</p>\n</div>"
  },
  {
    "id": 5,
    "title": "Основы 3D-моделирования и визуализации",
    "content": "<div class=\"practical-content\">\n  <h2>Практическая 5: Основы 3D-моделирования и визуализации</h2>\n  <p style=\"text-indent: 2em;\"><strong>Цели практической работы:</strong></p>\n  <ul>\n    <li>Освоить базовые методы создания трёхмерных моделей в CAD-системах.</li>\n    <li>Научиться использовать инструменты визуализации для оценки внешнего вида и функциональности моделей.</li>\n    <li>Развить навыки подготовки 3D-моделей для дальнейшего использования в проектировании и производстве.</li>\n  </ul>\n  <p style=\"text-indent: 2em;\"><strong>Задачи практической работы:</strong></p>\n  <ul>\n    <li>Изучить основные инструменты создания и редактирования 3D-объектов в выбранной программе.</li>\n    <li>Построить простую трёхмерную модель, используя базовые геометрические формы и операции.</li>\n    <li>Настроить материалы, освещение и камеры для визуализации модели.</li>\n    <li>Создать рендер изображения модели для презентации и анализа.</li>\n    <li>Сохранить и экспортировать 3D-модель в подходящих форматах.</li>\n  </ul>\n  <p style=\"text-indent: 2em;\">Данная практика поможет студентам получить практические навыки 3D-моделирования и визуализации, которые являются важными для современного инженерного проектирования и разработки изделий.</p>\n</div>"
  }
]
  